duxinglang-1/nRF9160_test/JPR/src/sensor/lsm6dso.c
  for (u8_t i = 0; i < 0x7f; i++)
  {
    struct i2c_msg msgs[1];
    u8_t dst = 1;

    /* Send the address to read from */
    msgs[0].buf = &dst;
    msgs[0].len = 1U;
    msgs[0].flags = I2C_MSG_WRITE | I2C_MSG_STOP;
		
    error = i2c_transfer(i2c_dev, &msgs[0], 1, i);
    if(error == 0)
	{
      LOG_INF("0x%2x device address found on I2C Bus\n", i);
    }
    else
	{
      //LOG_INF("error %d \n", error);
    }
  }
}

void IMURedrawSteps(void)
{
	u8_t x,y,w,h;
	u8_t strbuf[128] = {0};
	
	if(screen_id == SCREEN_IDLE)
	{
		LCD_SetFontSize(FONT_SIZE_16);
		
		LCD_Fill(IMU_STEPS_SHOW_X,IMU_STEPS_SHOW_Y,IMU_STEPS_SHOW_W/3,IMU_STEPS_SHOW_H,BLACK);
		sprintf(strbuf, "S:%d", g_steps);
		LCD_ShowString(IMU_STEPS_SHOW_X, IMU_STEPS_SHOW_Y, strbuf);

		LCD_Fill(IMU_STEPS_SHOW_X+IMU_STEPS_SHOW_W/3,IMU_STEPS_SHOW_Y,IMU_STEPS_SHOW_W/3,IMU_STEPS_SHOW_H,BLACK);
		sprintf(strbuf, "D:%d", g_distance);
		LCD_ShowString(IMU_STEPS_SHOW_X+IMU_STEPS_SHOW_W/3, IMU_STEPS_SHOW_Y, strbuf);

		LCD_Fill(IMU_STEPS_SHOW_X+2*IMU_STEPS_SHOW_W/3,IMU_STEPS_SHOW_Y,IMU_STEPS_SHOW_W/3,IMU_STEPS_SHOW_H,BLACK);
		sprintf(strbuf, "C:%d", g_calorie);
		LCD_ShowString(IMU_STEPS_SHOW_X+2*IMU_STEPS_SHOW_W/3, IMU_STEPS_SHOW_Y, strbuf);
	}
}

void IMUMsgProcess(void)
{
	if(int1_event)	//steps
	{
		LOG_INF("steps trigger!\n");

		GetImuSteps();
		int1_event = false;
		imu_redraw_steps_flag = true;
	}

	if(int2_event)	//fall or tilt
	{
		is_tilt();
		if(wrist_tilt)
		{
			LOG_INF("tilt trigger!\n");
			wrist_tilt = false;
			//¼ì²âµ½Ì§Íó

			lcd_sleep_out = true;
		}
		else
		{
			fall_detection();
			if(fall_result)
			{
				LOG_INF("fall trigger!\n");
				fall_result = false;
				//¼ì²âµ½Ë¤µ¹
			}
		}

		int2_event = false;
	}

	if(reset_steps)
	{
		reset_steps = false;
		ReSetImuSteps();
		imu_redraw_steps_flag = true;
	}

	if(imu_redraw_steps_flag)
	{
		imu_redraw_steps_flag = false;
		IMURedrawSteps();
	}
}

